{
    "data": "嗯，哇，所以呢呃所以就是说我们这呃它从反映到数值上的这个呃这个量化的这个指标，它是呃并不完全是一样的。嗯，ok那么回答这个问题的时候，需要小心啊，你需要这么回答。就是首先嗯从客户满意度的角度，你们是希望提升百分之十。而你们也分析了这个验收缺陷率和进度偏差率，实际上是对客户满意度产生了影响的。但是在你们去建模的过程中，你会发现进度偏差率和验收缺陷率这两个数值。在模型中呃，综合所有因素来看，他们两个对于最终的客户满意度呃，实际上产生的那个影响不是很大。但是又由于这两个指标各自看起来都比较重要，所以这里边把这两个指标的这个定的这个比率就定的会更高一点。这是一个你可以说它不是一个基于数字，或者说它不是一个基于量化结果分析得出的目标。它只是一个你们基于管控需要所定出来的目标。Ok就是一定要能够解释的清楚才可以。好，继续吧。好的好的，嗯，下面我们就围绕这个呃要实现。那么这个呃四个指标，我们怎么样制定相应的计划。那么这里是我们总体的一个计划。那么这里面的呃我们的这个度量目标的一个初始值。呃，它是基于我们二零二一年就是前一个年度的我们的这个呃呃咱们公司的这样一个就是呃研发团队的一个实际的一个工作指标统计出来的一个结果。那么这个目标值就是基于我们要达实现的这个新的目标。呃，我们呃在叠加的这个相应的改进幅度之后，我们需要呃实现的这个目标。那么下面是呃我们整个呃EPG这个活动，呃，他所那个就是整个EPG计划，它里面涉及到的合同的一些流程OK.那么下面我们逐个对这些目标的这个如何达成的这样一个情况来进行分析。首先第一个发布缺陷率呃，这个实际上也就是验收呃，测试缺陷率，这个它是一个意思。那么我们第一步是对发布缺陷率呃，它的这个数据的这个正态分布的情况进行分析。我们基于这个呃mini type的概率图这个工具来进行分析。那么右边是呃，那么这个概率图的情况，那么我们主要的一个判断依据就是根据这个概率图的一个p值，呃，看他是否是呃大于零点呃小于零点五的这样一个满足小于零点五的这样一个要求。多少零点五哦，零点零五，零点零五呃，是否是大于零点零五的呃，满足这样一个要求。那么如果呃，满足这个要求，他就说明是呃，他的正态检验是通过的。如果不满足呢，那么如果不满足的话，那么我们就要把这个概率图里面边缘的呃呃这些点，那么尝试着呃剔呃边缘剔出一个点，然后再呃重新生成它的概率图，然后看新的概率图的一个p值。那么你要剔除的这个点，在剔除它之前，你会做哪些工作吗？还是你就直接就只是把这些数据点去剔除掉。嗯，在在切入之前的话，我们主要就是看这个点，它的分布在在这个图上分布的位置。那么如那么首先那么剔出，那么最边缘的一个点。然后再如果他不满足要求，再提出，再接着提出下一个最边缘的点，那么直到它满足这个p值的这个阈值为为止。嗯，在剔除点之前，你们对于这个被剔除的数据会做什么分析吗？哦，ok那我们主任这一块没有其他的分析，主要就是基于这个概念图的，它这个呃它这个分布位置来选择被剔除的点。这个必须有这块儿应该怎么回答嘞？你可以说我们会分析一下这个数据它处在边缘的原因是什么啊，然后呢分析出它处在这个异常点的原因，我们会去给出一些这个改进的基于这样的一个分析，我们会提一些改进的建议，在未来的项目中避免类似的情况发生。但对但是对于我的建模工作来说，我是把它直接剔除掉的，就这样就好了。 Ok空哦，好的，就是分析它处在边缘的原因，并给出未来改进得建议。是的，然后关于这个部分呢嗯我可能会补充一两个证据，到时候会在每一年的建模的那个文档中去补充一个证据，一两个证据。那么大概会在本周内吧，周内本周内去发给你。然后到时候你可以在你的证据里更新一下，访谈的时候，你可以不贴这个，就是你的PPT是可以不贴这个证据。但是到时候你手上你要有，你知道你有这个证据，他如果问，你就把这个证据打开给他看就行了，好吧？嗯，好的好的好的，这是不明，ok继续了。好的，那么下面这三张图是呃另外的哎呀它的三个指呃下呃二级指标，也就是代码走查覆盖率以及单元测试覆盖率和系统测试覆盖率。它的这个概率图的情况。那么呃它正态检验的这个判断标准跟刚才那个呃，指标是一样的。那么接着我们通过main time里面的控制图这个工具来判断是否有异常数据。那么判断的一个方法就是呃在这个那么看每个指标的它这些数据点是否位于这个上控制线和下控制线之间。呃，如果没有呃超出这个上控制线和下控制线之间点就说明它满足这个呃控制图的要求，也就是没有异常的数据。那么再接下来我们主要就进行是进行的是这个相关性的分析。那么通过相关性的分析，我们主要是来判断数据的管控走走向。那么左边这一个是首先管控走向是目的。但是你分析的时候，应该直接说分析的是它的相关性，不要说分析管控走向。哦，好嘞好嘞，啊可以相关性分析，你们是怎么做的呢？呃，我们呃也是通过呃mini type里面的它的这个相关性分析的这个工具呃来呃来实施的。那么左边是它生成的一个矩阵图，那么右边是呃验收测试出现率和呃这个三个指标，他们之间的一个关关的关系。那么这里显示的是呃皮尔森相关的系数。那么这个系数呃我们看可以看出，那么呃他们这这这三个皮尔森相关系数都是呃负的，并且接近于负一。那么说明这个验测测试出现率与这个个指标。标间它是强负相关的一个关系啊。 Ok那什么样的这样的一个参数，你会认为它的这个关联性不强呢？呃，如果呃这个片身相关系数，它的呃它介于这个负零点五和零点五之间，呃，呃，或者说是它的绝对值小于零点五的话，我们通常是认为它是一个弱相关的关系。嗯，那么在你做这个PR三系数相关性分析的时候，p值可以用来做什么？ P值主要呃可以判断这个片层相关系术的它的一个呃一个可信度。嗯，那p值是多少？你就会认为这个结果是不可信的了呢？当皮质呃，大于零点零五，因为这块儿我我我确我不确定啊，当p值大于零点零五就不可信了。没错对，是这样继续吧，继续吧，ok继续。那么接下来我们进行这个呃回归分析。那么我们也是通过这个mini type里面的回归分析工具呃，来生成这个呃这四个参数之间的一个回归方程。那么这个响应的变量是验收测试准确率，那么这三个变量是它的一个影响因子。那么我们可以看到那个呃通过这个回归分析，在这个结果，我们主要来看一下这个呃RS对而SQ的这个呃分析。那么这里我们我们可以看出，那么呃在右边这个图里面呃，当我们这个使用这三个指标来进行预测的话，那么它的这个预测能力是八十九点四。那么如果我们去掉中间这个方程，我们只用第一个指标和第三个指标来预测的话，我们发现它的这个预测能力呃能够得到进一步的提高。啊，那么因此接下来我们就呃只用呃代码走查覆盖率和系统测试覆盖率来呃，进一步建立回归方程。那么这是我们重新建立的这个新的回归方程。那么呃那么最后我们就基于这个回归方程来进行下一步的分析OK.那么在进行回归方程的这样的一个分析的过程中，对于系数的结果里边方差或者说方差分析结果里边的p值你们是如何来判断的？方差分析里边的p值方哦，方差分析里面的p值嗯，呃通常这个p值需要满足这个呃小于零点五的一个要求。零点几所有的p值的分析的都是零点零五啊，零点零五啊，应该大于零点零五是吧，是应该小于零点零五，应该小于零点零。所以你会看到，在你的生成的这个回归方程里头，如果追求完美的情况下，就是只用系统测试覆盖率去做预测就可以了。但是你为了考虑更多的管控，所以你的代码走查覆盖率，在最后你的公式里头你仍然留着。因为它的预测能力尚可。虽然它的p值很大，但是你仍然把它留下了，这是你的一个人为的决策，你明白吗？哦，好的好的，嗯，但是p值就是在我们所有的分析的过程中，只要谈到p值，它的标准都是零点零五哦，无非是应该大于它还是小于它，但是标准都是零点零五。好的好的，那么现呃像这种这种呃，比如配置这种说明，那么如果老师没有问，我们需要主动去讲吗？不讲，如果老师不问，你就跳。如果老师问了，你再去说，当然如果你要想直接告诉他也可以。嗯，好的好的，我知道了。嗯，我不看。那么接下来我们呃来进行这个验收测试缺陷率的一个能力分析。呃，你讲的这个逻辑，ok你讲的这个逻辑啊啊，所以你建立了基线和模型之后，你你建立了基线之后，你是怎么做的呢？你做了什么什么事呢？建立了基线之后，检证经验之后，就是就是刚才的这个这几张幻灯片，就进行这个概率图控制图相关性分析和和归分析。嗯，你你稍稍你稍等往回你的这个PPT如果做成这样，你的讲的逻辑应该是这样的。呃，首先公司提出了一个年度的整一个计划是一个计划，然后那个计划是一个目标，对吧？对，给了你一个目标之后，这时候你是不是要把你具体的目标值设定出来，对你要设定具体的目标的时候，你得先建基线，因为没有基线则没有目标。对，所以你总体计划这一页PPT应该放在控制图分析之后，应该在控制图分析之后。对，因为控制图分析完了，意味着基线出来了，有了基线要调百分之三十，你的目标才能出来。哦哦，那那后面那比如说我把这个图放在这个控制图后，这一张放在放在控制图的后面，这是控制图啊。对，放在控制图在后面，你现在控制图在二视图之后。对啊对，这这是控制图控制在后面，然后控制的后面的是整体目标。整体目标有了之后，嗯，你要设定子过程的目标，所以你要做相关性的分析以及建模来去建立你的模型，来去知道你后续的那些东西该怎么控制，明白吗？哦，知道了，ok好，请继续你你继续走你的PPT啊。那现在就是这个方子，这个总体就是基线目标在这儿，然后再进行相关性分析回归分析。呃，然后然后这个努力声音总感觉就是有点跳跃，呃，并没有跳跃呀，避免这一块是放放在这里哈，你可以放在这里。好的，那么接下来我们进行验试呃呃，验收测试缺陷率的这个能力分析。我提醒你一件事啊，评估的时候你的备注是看不到的。好的，我知道嗯，我这个主要是也记一下你今天讲的这个内容。不管我讲的是什么，你不能依赖备注，你得不看备注的情况下能讲的出来。好的，你直接播放吧。哦，那么这里这个图是验收测试出现率的这样一个过程能力报告。那么我们可以看出这个它的PPK和CPK的值仅为零点六七。呃，过程能力没有达到标准的一点三三的这样一个要求，说明我们的过程能力呃明显不足，需要进一步的进行改进。嗯嗯，那么具体呃如何，你的啊逻辑先是那个，然后是这个对吧？哎，对，嗯，好，继续。那么我们呃呃为了改进这个呃它的能力，我们首先要要进行这个模特考的预测。那么它的一个呃前提就是在刚才我们建立的这个回归方程的呃这个基础上。那么我们通过预测之后发现呃，公司对于测试出现率的目标达成率仅为呃十七点六四存在较大的过程改进的一个空间。那么因此我们需要进行更新分析，来呃找到它的关键改进过程。那么这个呃关键改进过程的呃分析方法，我们是通过这个敏感度分析呃来找的。那么在这个图里面我们可以看出呃，系统测试出现率，那么它对这个结果的影响比较大，它的影响幅度高达百分之九十六点三。那么因此要降低验试呃，验收测试出现率百分之三十对应的系统测试覆盖率需要提升百分之三十一点一五。亲七。那么基于上述分析，我们呃，可以得到呃，下面两点改进方案。第一个就是通过加强测试用例的设计培训，使团队设计更完整的测试用例。第二个是加强呃，通过加强测试用例评审，保证测试用例的覆盖覆盖率。 Ok那么上上面是我们对呃验呃验收测试呃，呃呃这个这个指标我咋不记得验收测试出现率的呃这样一个分析过程。那么接下来我们呃对进度偏差率、工作效率以及客户满意度的这个分析过程跟呃刚才的分析过程呃，基本上是类似的。我们一起来看一下，有问题停停。嗯，你讲的时候缺了一页。嗯，你的度量目标和度量指标都没有。你的度量指标，你的度量目标最后定出来的目标是什么？你通过你既然你你敏感度分析分析完了，对吗？对你说验收测试确认率要降低百分之三十，对应的系统测试覆盖率要提升百分之三十一点一五。那么系统测试覆盖率的目标的值是什么呢？啊嗯你不觉得你讲的时候少用了一页的文档吗？你打开你的EPG的计划及报告，这个这个我是我是在我不知道是不是这张图啊。你看我是在把这四个指标讲完了之后，最后汇总到呃，我不知道你指的是不是这个图，是是这个是这张目标是这个不。所以理论上你应当把这一张的进度目标先切过去，先把进个目标的全部讲完。你要用一个完整的故事告诉别人，你这样子你就把目标设定了，方案设定了。然后你后头的再快速讲。因为你如果不切过去，呃，你你刚才讲的是质量目页目标，质量目标吗？如果你不切过去讲的话，你的整个故事是不完整的。就是你的度量目标是不完整的。你就讲到下一个去了，然后你最后引入到这一页，别人会记不起来，你是怎么设的？所以从逻辑关系上来讲，你应当把质量目标的部分单切一页过去。呃，就是把这一部分也切过来，然后切一下刚才那个最后一张幻灯片的后面。对，好的好的，我知道了当就是把你的每一个过程讲到最后一页，哎，你的目标就设定好了。在你有了改进方案，你就是你有了目标，你有改进方案，所以你应该切在敏感度分析后头的那一页。哦，好的好的，就是改进方案，前一页那个浏览器后一页。对，就是对后面就是说相当于把这个个最后们分分析的这个结果，呃，就是需要要要改进这个目标的一个具体的值，切在切在这个后面。对，这样子你的你这个逻辑就是完整的了嘛，不然的话你这个逻辑你这个三十一点五讲完了，好像这三十一点五没地方使用它嘛。嗯，好的好的嗯，好OK.好，剩下的几个故事你不用给我讲了过吧？然后来讲二零二二年的报告阶段，好的，剩下的几个指标的大的逻辑，实际上跟刚才类似的，到时候我也相应的调整一下。嗯，看那么那么通过对刚才呃上面四个指标的分析，最后我们汇总在一起就获得了我们二零二二年的这个EP计划。 Ep计划的总呃总体的一个度量的目标就是在这个表格里面呈现的内容。其实那么有了这个目标之后，我们就需要制定具体的这个试点计划。那我们呃首先那个实施的策略呃，主要是通过利用原型工具进行的需求确认。那么在设计和研发阶段呃，反复进行呃，需求的确认，并且通过测试用例设计培训，使团队设计更完整测试用例，同时来保证测试用例的这个覆盖率。呃，并且加强研发标准的培训，降低团队的这个bug率open率。呃，通过测试人员的监控和管理来降低bug呃，reopen率。并且加强代码缺陷分析来降低。你不用你不用一个一个的念，在评估的时候讲这种东西，你给我们要讲管理过程。好的好的，那么我们制定相应的这个实施策略。然后在我们呃这这样下面这四个项目里面来进行具体的试点。那么试点结束之后，我们呃，进行了试点效果的评估。那么主要使用的方法就是双样本期检验。那么这里呃左边这张图是对客户满意度的这样一个双样本去检验的一个呃，检验结果。那么我们主要是通过判断的，它这个p值呃，当p值大于零点零五的时候，我们认为呃这两个样本之间它在统计学意义上是没有本质区别的。那么同样呃这个右边这张图是验收呃验收测试出现率的一个双样本体检验的一个结果。Ok那么ok稍等一下。所以这里头你的这个PPT讲的双本t的分析讲的没有问题。但是你这时候要能够告诉我们的一个故事，是我的四个目标，试点的情况怎么样，结果怎么样？所以你不能这样贴东西进来，你要怎么贴呢？你要把客户满影响客户满意度的那个那个指标子过程的指标是啥？哦，因为这几个我都都贴过来了，可能是不是贴个顺序不是，所以它的顺序应当是左侧一个子过程，右侧一个结果啊。你用四页PPT贴的话，就是每一页都是左侧是子过程右侧结果。所以你讲的逻辑是我们二零二二年通过提升需求确认率从零点八三八三提升到了零点八七七嗯，从而引发客户满意度从零点七九零提升到了零点八九二。虽然在统计学意义上不明显，但是有了较大提升。你要把这个故事链给它讲出来，你现在这样去讲，等于是你倒讲了。好的好的，就应该把这个左边是图，然后右边就是刚才这个结论里面的文字，把它放在一个左边是图，它应该是两张图，一个是需求确认力的图，然后客户满意这个图他俩应该放在一页的讲，对，明白吧？对对，好的，我明白ok好，继续吧。好，那么这呃最后我们得出来的相应的这个试点评估，这这不用不用不用念，往后我这个对着念的东西不用给我念，好，加点夜巴。那么在训练评估的基础上，我们制定了如下的一个推广计划。呃，在这里的是个十五个项目里面，我们进行了相应的推广。这那么在二零二二年年底，我们针对前年全年的这个改进结果呃，进行了分析。那么首先在呃客户满意度的这个数据，呃，我们也是经过这个呃双样本体检验和这个呃控制图的一个分析。我们发现那么需求确认率通过二零二二年的过程改进，从零点八三八三提高到了零点八五四七。那么但你的影响是，二零二二年的客户满意度从历史数据的零点七九五提升至了零点八五六九，那么客户满意度提升的效果比较明显。那么通过控制图可以看出，大约有三分之一的项目做到了目标均值。呃，零点八七四三以上，仍然有少部分数据处于客户满意度比较低的这个位置，客户满意度方面的构成能力仍然欠缺，要进一步的加强。 Ok这个后续的不用念了，就是大概你的ppt的逻辑是不是就到此就结束了，每一年都是这样。呃，这四个指标我看后面啊哎对，明年就是这样，后面就是二零二三年的。 Ok所以你不用给我再讲后续的了，你的部分应该没有太大问题。然后按照我刚才给你讲的那个内容，你把该补充的补充上去就好了。好的好的，嗯，调整一下就ok.然后从逻辑上讲，你的PPT没有太大的问题。但是你你你让我看你往前移，嗯，你这是个二零二三，这是二零二三年的第一页，他的这个呃改进目标。嗯，然后你这样不行，你这样不行。所谓的简化，仍然要把证据都贴上，呃，要把那些图都贴上是吧？对，就是所谓的简化，就是你一页你的你刚才不是验收测试缺荐率，你用了好几页讲嘛，你到换了一年之后，你按照你第一年的那个什么进度偏差率，客户满意度和工作效率的那个贴法，你把这四个也都得贴上。就是数据所有的跟数据相关的内容，你还得贴，你不能只用文字去代替，那就是切的话，那可以图缩小是吧？你图可以缩小，说我仍然是这样子去做的，但是你得往上贴，然后你往后往右再走一，你你这个也得贴，你就是你，你不能简化到这个程度，贴图该贴的都得贴，然后继续往后。那你每一年的你后头两年，你知道你讲的重点是什么吗？你后头两年着重要讲你的推广的效呃，你的那个那叫试点的效果和推广的效果。通过三年的这个变化，你最后达到了一个什么水平？是要用你的这个PPT告诉我评估老师的，你这个后头这么一省略，该讲的关键内容，你等于都被陨略掉了。所以那些东西都得所谓的简化。只是说变小的部分，你可以用变小的图形去讲说哎我类似的项目建模。但是你每一年的试点的分析和推广的分析，你仍然要给他。因为他要看你看到一个完整的故事，看到你的整个的改进，最后有没有达标，最后达到了一个什么水平。所以所有的双样本t检验和单值控制图的那个分析，理论上你都应当在你的PPT里头使用到没有一个是废物。哦，好的好的好的，嗯，所以你你这个讲化程度是不行的，你得你对PPT该就要大改了，你改完了，到时候发一份，让我们再看看吧。好的好的好的，我们就把后面的内容都都缩那个图的缩小贴上去。 Ok好，那我们接着来看另一份吧，你退不出去，我我我结束共享了，就嗯嗯为什么是稍等一下啊？嗯一。",
    "status": "success",
    "code": 0
}